[
    {
        "_id": "0282e0e58a5c404fbd15261f11c2ab6a",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": true
        },
        "category_id": "01",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 488,
        "title": "Modern React with Redux",
        "author": {
            "name": "Jimmy Dane",
            "published_date": "2022-08-24 17:27:34",
            "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
        },
        "thumbnail_url": "https://images.unsplash.com/photo-1633356122102-3fe601e05bd2?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80",
        "image_url": "https://images.unsplash.com/photo-1633356122102-3fe601e05bd2?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80",
        "details": "Congratulations!  You've found the most popular, most complete, and most up-to-date resource online for learning React and Redux!

        Thousands of other engineers have learned React and Redux, and you can too.  This course uses a time-tested, battle-proven method to make sure you understand exactly how React and Redux work, and will get you a new job working as a software engineer or help you build that app you've always been dreaming about.
        
        The difference between this course and all the others: you will understand the design patterns used by top companies to build massively popular web apps.
        
        React is the most popular Javascript library of the last five years, and the job market is still hotter than ever.  Companies large and small can't hire engineers who understand React and Redux fast enough, and salaries for engineers are at an all time high.  It's a great time to learn React!
        
        ----------------------
        
        What will you build?
        
        This course features hundreds of videos with dozens of custom diagrams to help you understand how React and Redux work.  No prior experience with either is necessary. Through tireless, patient explanations and many interesting practical examples, you'll learn the fundamentals of building dynamic and live web apps using React.
        
        Each topic included in this course is added incrementally, to make sure that you have a solid foundation of knowledge.  You'll find plenty of discussion added in to help you understand exactly when and where to use each feature of React and Redux.
        
        My guarantee to you: there is no other course online that teaches more features of React and Redux.  This is the most comprehensive resource there is."
    },
    {
        "_id": "0282e0e58a5c404fbd15261f11c2ab6b",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": true
        },
        "category_id": "03",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 488,
        "title": "HTML and CSS for Beginners - Build a Website & Launch ONLINE",
        "author": {
            "name": "Jimmy Dane",
            "published_date": "2022-08-24 17:27:34",
            "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
        },
        "thumbnail_url": "https://images.unsplash.com/photo-1589149098258-3e9102cd63d3?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=739&q=80",
        "image_url": "https://images.unsplash.com/photo-1589149098258-3e9102cd63d3?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=739&q=80",
        "details": "This step-by-step HTML and CSS course will help you learn coding fast and with an instructor that really cares about his students.

        Learning to code will help you make more money in your job, or even find a better job, or better yet, get a nice job as a web developer.
        
        HTML and CSS are the foundations you need to get into any programming language.
  
        Everything new is hard but programming doesn't have to be. Learning HTML and CSS is the first stepping stone you need to start programming . This course was created with a dummy approach, meaning even people with difficulty learning technology will learn. I also guaranteed that even small kids can learn its material. You will feel like you are beside me when taking the lecture, we will be buddies until the end of this course and even after. After this course, you will have a good understanding of HTML and CSS and will be able to start your journey into the beautiful world of programming."
    },
    {
        "_id": "f69a695f037cd9484cecaea37ca71011",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": true
        },
        "category_id": "01",
        "rating": {
            "number": 4.8,
            "badge": "Excellent"
        },
        "total_view": 400,
        "title": "React - The Complete Guide",
        "author": {
            "name": "Jennifer Wood",
            "published_date": "2022-08-30 16:38:45",
            "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
        },
        "thumbnail_url": "https://images.unsplash.com/photo-1569748130764-3fed0c102c59?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80",
        "image_url": "https://images.unsplash.com/photo-1569748130764-3fed0c102c59?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80",
        "details": "This course is fully up-to-date with React 18 (the latest version of React)!

        It was completely updated and re-recorded from the ground up - it teaches the very latest version of React with all the core, modern features you need to know!
        
        ---
        
        This course also comes with two paths which you can take: The complete path (full >40h course) and the summary path (~4h summary module) - you can choose the path that best fits your time requirements! :-)
        
        ---
        
        React.js is THE most popular JavaScript library you can use and learn these days to build modern, reactive user interfaces for the web.
        
        This course teaches you React in-depth, from the ground up, step by step by diving into all the core basics, exploring tons of examples and also introducing you to advanced concepts as well.
        
        You'll get all the theory, tons of examples and demos, assignments and exercises and tons of important knowledge that is skipped by most other resources - after all, there is a reason why this course is that huge! :)
        
        And in case you don't even know why you would want to learn React and you're just here because of some ad or the algorithm - no worries: ReactJS is a key technology as a web developer and in this course I will also explain WHY it's that important!
        
        
        
        Welcome to React - The Complete Guide
        
        This course will teach you React.js in a practice-oriented way, using all the latest patterns and best practices you need. You will learn all the key fundamentals as well as advanced concepts and related topics to turn you into a React.js developer.
        
        This is a huge course because it really covers EVERYTHING you need to know and learn to become a React.js developer!
        
        No matter if you know nothing about React or if you already got some basic React knowledge (not required but also not a problem), you will get tons of useful information and knowledge out of this course!
        
        My goal with this course is to ensure that you feel confident working with React, so that you can apply for React jobs, use it in your own projects or simply enhance your portfolio as a developer - whatever your goal is: This course gets you there!"
    },
    {
        "_id": "f69a695f037cd9484cecaea37ca71012",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": true
        },
        "category_id": "02",
        "rating": {
            "number": 4.3,
            "badge": "Excellent"
        },
        "total_view": 400,
        "title": "Javascript for Beginners",
        "author": {
            "name": "Jennifer Wood",
            "published_date": "2022-08-30 16:38:45",
            "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
        },
        "thumbnail_url": "https://images.unsplash.com/photo-1592609931095-54a2168ae893?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80",
        "image_url": "https://images.unsplash.com/photo-1592609931095-54a2168ae893?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80",
        "details": " As a business guy I have no place in programming.  Ten years ago you could have gotten away with that statement. Today you say that to your colleagues and they scoff at you before they go back to their computers to fix real problems and do real work.

        If you want to do something useful start by learning Javascript . In these days when the browser is central to all computer use knowing  the language of the browser  is the most important step. A few years ago Javascript potential was uncertain and many programmers considered it useless. These days however competent programmers have identified Javascript real potential and uses and it has gone from a toy language to the main language of the browser. It has become one of the most useful languages of this era. Every developer needs at least a basic understanding of Javascript. A developer who knows Javascript is the rockstar of the company and is in constant demand by employers. Our online Javascript
        
        course will get you started by teaching all the essential aspects of coding in Javascript. So... what's it gonna be? Do you want to supercharge your career and be in constant demand by employers? Do you want to learn how to create dynamic and innovative Javascript documents? Start programming today with our Javascript course for Beginners training and take control of your career."
    },
    {
        "_id": "11468ed61aee84de492a8b04158a22f9",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": false
        },
        "category_id": "03",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 980,
        "title": "Joe Biden announces $3 billion in Ukraine weapons aid",
        "author": {
            "name": "system",
            "published_date": "2022-08-24 23:15:00",
            "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
        },
        "thumbnail_url": "https://images.unsplash.com/photo-1524666643752-b381eb00effb?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=871&q=80",
        "image_url": "https://images.unsplash.com/photo-1524666643752-b381eb00effb?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=871&q=80",
        "details": "You can launch a new career in web development today by learning HTML & CSS. You don't need a computer science degree or expensive software. All you need is a computer, a bit of time, a lot of determination, and a teacher you trust. I've taught HTML and CSS to countless coworkers and held training sessions for fortune 100 companies. I am that teacher you can trust. 

        Don't limit yourself by creating websites with some cheesy site-builder tool. This course teaches you how to take control over your webpages by using the same concepts that every professional website is created with.
        
        This course does not assume any prior experience. We start at square one and learn together bit by bit. By the end of the course you will have created (by hand) a website that looks great on phones, tablets, laptops, and desktops alike.
        
        In the summer of 2020 the course has received a new section where we push our website live up onto the web using the free GitHub Pages service; this means you'll be able to share a link to what you've created with your friends, family, colleagues and the world!"
    },
    {
        "_id": "11468ed61aee84de492a8b04158a22f0",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": false
        },
        "category_id": "01",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 980,
        "title": "Complete React Developer in 2022",
        "author": {
            "name": "system",
            "published_date": "2022-08-24 23:15:00",
            "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
        },
        "thumbnail_url": "https://images.unsplash.com/photo-1552308995-2baac1ad5490?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80",
        "image_url": "https://images.unsplash.com/photo-1552308995-2baac1ad5490?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80",
        "details": "Just FULLY updated and re-recorded with all new React features for 2022 (React v18)! Join a live online community of over 600,000+ developers and a course taught by industry experts that have actually worked both in Silicon Valley and Toronto with React.js.

        Using the latest version of React (React 18), this course is focused on efficiency. Never spend time on confusing, out of date, incomplete tutorials anymore. Graduates of Andrei’s courses are now working at Google, Tesla, Amazon, Apple, IBM, JP Morgan, Facebook, + other top tech companies.
        
        We guarantee you this is the most comprehensive online resource on React. This project based course will introduce you to all of the modern toolchain of a React developer in 2022. Along the way, we will build a massive e-commerce application similar to Shopify using React, Redux, React Hooks, React Suspense, React Router, GraphQL, Context API, Firebase, Redux-Saga, Stripe + more. This is going to be a full stack app (MERN stack), using Firebase.
        
        The curriculum is going to be very hands on as we walk you from start to finish of releasing a professional React project all the way into production. We will start from the very beginning by teaching you React Basics and then going into advanced topics so you can make good decisions on architecture and tools on any of your future ReactJS projects.
        
        All code is going to be provided step by step and even if you don’t like to code along, you will get access to the the full master project code so anyone signed up for the course will have their own project to put on their portfolio right away."
    },
    {
        "_id": "2e78e5e0310c2e9adbb6efb1a263e745",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": true
        },
        "category_id": "02",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": null,
        "title": "1 Hour JavaScript",
        "author": {
            "name": null,
            "published_date": "2022-08-30 15:00:04",
            "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
        },
        "thumbnail_url": "https://plus.unsplash.com/premium_photo-1661692759400-15aa4e2de6c3?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80",
        "image_url": "https://plus.unsplash.com/premium_photo-1661692759400-15aa4e2de6c3?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80",
        "details": "Have you ever wanted to learn how to code but didn't know where to start? This is a fantastic course to start. Not only is JavaScript easy to learn but it is in demand? If you take this course you will start the fantastic process of learning to code which will lead you to a better life. Coding is one of the most in demand skills if you can code you have a job.



        The best part is that this is for complete beginners! Coding is a fantastic career to get into and this is the first course you should take. All web developers start with JavaScript and it is by far the easiest language to learn. JavaScript is one of the most prominent languages out there. When JavaScript first came out, it was really basic but now it's the building block of almost any web application. JavaScript developers will always be in demand.
        
        
        
        Just think of all of the things you can do in 1 hour and imagine learning a whole new skill. That's why these 1 hour lessons are so valuable. Take a look at the reviews, they speak for themselves.
        
        
        
        What are you waiting for, enroll today."
    },
    {
        "_id": "a713ee936ff5574273f0f769f5c5b20e",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": true
        },
        "category_id": "03",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 111,
        "title": "1 Hour CSS",
        "author": {
            "name": "system",
            "published_date": null,
            "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
        },
        "thumbnail_url": "https://images.unsplash.com/photo-1572985025058-f27aeca1b8bf?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=871&q=80",
        "image_url": "https://images.unsplash.com/photo-1572985025058-f27aeca1b8bf?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=871&q=80",
        "details": "Have you ever wanted to learn to code but don't know where to start? Learning how to code can get you a better job and lead to a better future. In this tutorial series you get to learn about CSS. CSS is the number design language for the web. CSS is easy to learn and it is used in most web development today. This course is a 1 hour course of action packed material. By the end of it you will have a firm understanding of the concepts of CSS. 

        The best part is that this is for complete beginners! Coding is a fantastic career to get into and this is the first course you should take. All web developers start with CSS and it is by far the easiest language to learn. CSS stands for cascading style sheets and it is the what makes websites look good. Before CSS, websites didn't look good at all.
        
        Just think of all of the things you can do in 1 hour and imagine learning a whole new skill. That's why these 1 hour lessons are so valuable. Take a look at the reviews, they speak for themselves.
        
        
        What are you waiting for, enroll today."
    },
    {
        "_id": "e342b6c0c8efc8ca9e811991dc8a7900",
        "others_info": {
            "is_todays_pick": true,
            "is_trending": false
        },
        "category_id": "04",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 733,
        "title": "The Modern Angular Bootcamp",
        "author": {
            "name": "Theo Minh Châu",
            "published_date": "2022-08-25 06:03:00",
            "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
        },
        "thumbnail_url": "https://images.unsplash.com/photo-1561883088-039e53143d73?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80",
        "image_url": "https://images.unsplash.com/photo-1561883088-039e53143d73?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80",
        "details": "If you want to build large, scalable apps, Angular is the Javascript framework to learn!

        Angular has been under development by Google for nearly a full decade.  It has one purpose: scale up to gracefully handle the largest and most complex web apps around.  If you want to build a big app, Angular is the way to go.  Every other course online around Angular shows you how to use the basic syntax and features of Angular, but only this course will show you how to build large, professional projects using Angular. 
        
        Mastering Angular by reading the documentation alone is challenging.  The official documentation always offers multiple ways to achieve any simple task, but never clarifies what the best way to do something is.  In this course, you will gain a fundamental understanding of the best way to achieve any goal with Angular, along with an explanation of the pros and cons of each possible approach.
        
        Top companies are hungry for Angular developers.  You've probably heard of the crazy salaries being offered for front-end developers.  The average starting salary for an Angular developer is $115k USD.  That is not an exaggeration, it is not a joke - this is how badly employers are looking for Angular developers.  You can be the latest hire at a new tech startup, a fantastic engineer with amazing skills in Angular!  All you have to do to earn this salary is understand Angular, and this course will help you do that."
    },
    {
        "_id": "e342b6c0c8efc8ca9e811991dc8a7901",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": false
        },
        "category_id": "04",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 733,
        "title": "Complete Angular Developer in 2022: Zero to Mastery",
        "author": {
            "name": "Theo Minh Châu",
            "published_date": "2022-08-25 06:03:00",
            "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
        },
        "thumbnail_url": "https://images.unsplash.com/photo-1592609931095-54a2168ae893?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80",
        "image_url": "https://images.unsplash.com/photo-1592609931095-54a2168ae893?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80",
        "details": "Just released with all new Angular best practices and trends for 2022! Join a live online community of over 600,000+ developers and a course taught by industry experts that have actually worked both in Silicon Valley and Toronto with Angular.

        Using the latest version of Angular, this course is focused on efficiency and turning you into a professional Angular developer. Never spend time on confusing, out of date, incomplete tutorials anymore! Graduates of Andrei’s courses are now working at Google, Tesla, Amazon, Apple, IBM, JP Morgan, Facebook (Meta), + other top tech companies for a reason.
        
        We guarantee you this is the most comprehensive online resource on Angular. This project based course will introduce you to all of the modern toolchain of an Angular (formally AngularJS/Angular.js) developer in 2022. Along the way, we will build a massive video sharing application using Angular, TypeScript, WebAssembly, Rust, RxJS, TailwindCSS, Firebase and much more! This is going to be a Fullstack app. We will also build other mini projects along the way so you feel confident deploying any Angular project to production in the future by yourself!"
    },
    {
        "_id": "f06f8cc035b04bd1158e4198281915a3",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": true
        },
        "category_id": "05",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 127,
        "title": "9 Things to do in Colorado this Labor Day weekend",
        "author": {
            "name": "Ukrainska Pravda",
            "published_date": "2022-08-25 18:53:49",
            "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
        },
        "thumbnail_url": "https://i.ibb.co/0swsWpF/unsplash-Eh-Tc-C9s-YXsw-17.png",
        "image_url": "https://i.ibb.co/H4p2t3V/unsplash-Eh-Tc-C9s-YXsw-6.png",
        "details": "COLORADO, USA — Happy Labor Day weekend! Although it may be the unofficial end to summer, there's still time to head outdoors and experience all that Colorado has to offer during the season. Taste of Colorado highlights a packed weekend of festivals which includes music, food, arts, crafts, balloon, wine and beer celebrations. There are early signs of autumn, however. College football is back with three games this weekend and the first Oktoberfest steins of the year will be raised in Keystone and Beaver Creek. Check out one of these awesome events happening across the Centennial State this Labor Day weekend. Remember to share your weekend photos with the \"Near Me\" feature on the 9NEWS app. > Submit an event to 9Things To Do . Credit: A Taste of Colorado Taste of Colorado DENVER — Colorado's signature Labor Day weekend festival is back at Civic Center Park in downtown Denver. The 39th annual Taste of Colorado will be held Saturday, Sept. 3 to Monday, Sept. 5. This year's event features five stages where attendees can listen to music from more than 60 artists including tribute bands, country musicians, jazz, cultural lineups and Denver bands. An Arts & Crafts Marketplace will have 50 local artisan booths and over 30 food trucks and restaurant vendors. Credit: Colorado State Fair Colorado State Fair PUEBLO — T he largest summer event in Colorado continues this weekend in southern Colorado. The Colorado State Fair offers a carnival, 4-H exhibits, agricultural competitions, tractor pulls, live music performances, rodeos, bake offs and amazing food options. T he Colorado State Fair runs through Monday, Sept. 5 with concerts from The Band Perry and Stone Temple Pilots, p lus monster truck shows and a demolition derby. Check out the full fair schedule at ColoradoStateFair.com . Credit: Windsor Harvest Festival The 96th Annual Windsor Harvest Festival arrives September 2 to 4, 2018 in Windsor, Colorado. Photo Courtesy: Windsor Harvest Festival. Windsor Harvest Festival WINDSOR — Windsor's largest family-friendly event is back for a 100th year this Labor Day weekend. This year's Windsor Harvest Festival theme is \"Build for the Future While Honoring the Past.\" The festival runs from Saturday, Sept. 3 to Monday, Sept. 5 with live music, a street dance, BBQ, car show, pancake breakfast, horse-drawn carriage rides, outdoor games, beer garden, movie screening in the park, and firework show. Balloon launches are planned for Saturday and Sunday at 6:30 a.m. at Eastman Park. A parade steps off at 9 a.m. Monday. Visit W indsorHarvestFestival.com to see the complete schedule. Credit: Colorado Springs Labor Day Lift Off Labor Day Lift Off COLORADO SPRINGS — A Southern Colorado tradition returns this weekend with the Colorado Springs Labor Day Lift Off . Running Saturday, Sept. 3 through Monday, Sept. 5, the free event begins each morning with an ascension of over 70 balloons accompanied by breakfast and drinks from local vendors. Throughout each day there will be skydiving demonstrations, wakeboarding exhibitions, paddle boarding and live entertainment. Evening balloon glows are set for Saturday and Sunday at 7:30 p.m. The Colorado Springs Labor Day Lift Off takes place at Memorial Park. Credit: Matthew Murphy Hadestown Hadestown DENVER — \"Hadestown,\" the winner of eight Tony Awards in 2019 including Best Musical, has just opened at Denver's Buell Theatre. \"Hadestown\" intertwines the tales of young dreamers Orpheus and Eurydice with that of King Hades and his wife Persephone on hell-raising journey to the underworld and back. With an exceptional cast of actors, dancers and singers, the musical is a haunting but hopeful theatrical experience that grabs you and never lets go. \"Hadestown\" plays the Buell Theatre through Sunday, Sept. 11. Credit: Denver Chalk Art Festival Denver Chalk Art Festival DENVER — The annual Denver Chalk Art Festival has moved to Denver's Golden Triangle neighborhood this weekend. The street painting festival, which runs Saturday, Sept. 3 through Monday, Sept. 5, will have 150 artists creating awe-inspiring works of chalk art. The festival is two blocks south of Civic Center Park (and Taste of Colorado) near 12th and Bannock and the Denver Art Museum. Credit: Seven Peaks Music Festival Seven Peaks Music Festival VILLA GROVE — Seven Peaks Music Festival returns for a third edition this weekend with a star-studded country music lineup. Dierks Bentley and Morgan Wallen headline the festival with guests Boy Named Banjo, Ashley Cooke, Jordan Davis, Jackson Dean, Travis Denning, Hardy, Kendell Marvel, Ashley McBryde, Old Crow Medicine Show, Caitlyn Smith, Rapidgrass, Alana Springsteen and Lainey Wilson. Seven Peaks Music Festival runs Friday, Sept. 2 to Sunday, Sept. 4 in Villa Grove, located about 45 miles south of Buena Vista. Labor Day Weekend in Creede CREEDE — Creede's Labor Day Weekend celebration is packed with events including a mountain run, outdoor movie, music, theater and more. The 36th annual Creede Mountain Run takes place Saturday, Sept. 3. Participants will enjoy the breathtaking San Juan Mountains in 50K, 22 mile, 12 mile and two-mile runs. Registration is available online . To see the complete Labor Day Weekend schedule, visit Creede.com . Credit: KUSA TCU vs. Colorado BOULDER — The University of Colorado football teams opens the 2022 season on Friday, Sept. 2. The CU Buffaloes host TCU in a nationally-televised game on ESPN with an 8 p.m. kickoff. Fans are encouraged to wear black to the game. A new sound system will also make its debut at Folsom Field on Friday. Season and single game tickets remain available at CUBuffs.com . RELATED: CU's football stadium will sound different in opener vs. TCU Northern Iowa vs. Air Force COLORADO SPRINGS — Air Force Academy football opens its season on Saturday, Sept. 3 against Northern Iowa in the first meeting between the schools. Northern Iowa head coach Mark Farley enters his 22nd season with the Panthers as the most winningest coach in program history. Air Force Falcons head coach Troy Calhoun is 15-0 against teams from the Football Championship Subdivision. The Falcons and Panthers kick off at 11 a.m. Saturday at Falcon Stadium. Houston Baptist vs. Northern Colorado GREELEY — University of Northern Colorado head coach Ed McCaffrey leads the Bears onto the field at Nottingham Field on Saturday, Sept. 3 at 2 p.m. against Houston Baptist. Last year, linebacker David Hoage recorded three sacks against Houston Baptist, the most since 2017. Fans should arrive early for the Pepsi Fan Fest, Bears, Brews and Bites and tailgate with fellow Bear fans. Credit: Water World Water World’s final weekend FEDERAL HEIGHTS — This is the final weekend of 2022 to visit one of America's largest family water parks. Water World 's final three days of operation this season are Saturday, Sunday and Monday. Water World features more than fifty attractions, from kids rides to huge thrill rides. Most food and drinks can be brought into the park making it perfect for picnics and parking is free. Avoid the lines and get your tickets online . Elitch Gardens water park DENVER — Elitch Gardens closes its water park on Sunday, Sept. 4. The main amusement park area will remain open through Sunday, Oct. 30 in downtown Denver. Credit: Cirque du Soleil Ovo LOVELAND — Cirque du Soleil has brought a touring circus to Colorado for the first time since 2019. \"Ovo\" is in Colorado Springs before heading to Denver next weekend. The show \"Ovo\" — meaning \"egg\" in Portuguese — is comprised of 100 people from 25 countries, including 52 artists, with high-level acrobatic acts. \"Ovo\" is at Broadmoor World Arena through Sunday, Sept. 4. Tickets are sold at AXS.com . RELATED: Cirque du Soleil returns to Colorado Credit: Jurassic World: The Exhibition Jurassic World: The Exhibition DENVER — This is the final weekend to see \"Jurassic World: The Exhibition\" at the Stockyards Event Center of the National Western Center. An immersive 20,000-square-foot experience based on the blockbuster movie franchise, \"Jurassic World: The Exhibition\" allows visitors to walk through the world-famous Jurassic gates, encounter life-sized dinosaurs and explore richly themed environments. Tickets are on sale at JurassicWorldExhibition.com . The show will be in Denver through Monday, Sept. 5. Credit: Taryn Parker; Broncos 7K Broncos Fit 7K DENVER — The 10th annual Broncos Fit 7K returns to Empower Field at Mile High on Sunday, Sept. 4. All runners will receive an exclusive Broncos shirt, finisher's medal and the experience of racing across the field and crossing the 50-yard line. Proceeds will benefit Denver Broncos Charities. Register at DenverBroncos.com . Labor Day Half Marathon, 10K and 5K PARKER — Celebrate the holiday weekend with a half marathon, 10K or 5K . There's a distance for everyone at Monday's races at Parker's Salisbury Equestrian Park. Runners of all abilities are welcome. Each participant gets a running shirt, finisher's medal, chip timing and race photos. Race registration is available at ColoradoRunnerEvents.com . Credit: DCPA David Byrne and Mala Gaonkar Theater of the Mind DENVER — \"Theater of the Mind\" is a new theatrical experience you’ll see, feel, taste and hear, co-created by Academy, Grammy, and Tony Award-winning artist David Byrne and writer Mala Gaonkar. Witness the wonders of your mind for yourself as you follow The Guide through a spectacular, 15,000-square-foot installation in a group of 16 audience members. \"Theater of the Mind\" takes place at the York Street Yards at 39th and Steele through Dec. 18. RELATED: David Byrne brings his creative talents to Denver for DCPA's latest show Credit: Saint Rafka Maronite Catholic Church Lebanese and Middle Eastern Festival LAKEWOOD — Saint Rafka Maronite Catholic Church is hosting its annual Lebanese and Middle Eastern Festival on Saturday, Sept. 3, from 11 a.m. to 10 p.m. at 2301 Wadsworth Blvd in Lakewood. Experience this unique cultural and culinary festival featuring authentic Lebanese and Middle Eastern cuisine and entertainment with fun for everyone. Credit: Keystone Festivals Keystone Oktoberfest KEYSTONE — Oktoberfest season officially arrives with Saturday's 9th annual Oktoberfest at Keystone’s River Run Village . Attendees will be raising their steins, dancing to oompah bands and savoring delicious German fare. The festival, which runs from 1 p.m. to 6 p.m., will have live music, food and seasonal beer. The festival will also have a kids’ area with crafts and dance performances from the Denver German Traditional Dance Group. If you buy a commemorative 2022 stein, you'll get three beer tokens. Stein tickets are available online . Beaver Creek Oktoberfest BEAVER CREEK — Beaver Creek’s long-running Oktoberfest is a family-friendly celebration of traditional live music, food and drink the heart of a Bavarian-inspired village. Festivities planned on Friday, Saturday and Sunday include stein-hoisting competitions, bratwurst-eating competition, kids’ zone, Oktoberfest shuffle, best-dressed contest and live music from Trachtenkapelle, The Helmet Fricker Band, Philadelphia Freedom and more. A complete schedule can be found at BeaverCreek.com . Castle Rock Brew Fest Under the Stars CASTLE ROCK — The Castle Rock Brew Fest Under the Stars is Sunday, Sept. 4 at Philip S. Miller Park. The fest will offer craft beer from more than 20 breweries, food from eight food trucks and four bands. Each ticket comes with admission, unlimited food, eight-ounce craft beer pours and live entertainment until 9 p.m. Tickets are available online . Fountain Fall Festival & Parade FOUNTAIN — The 52nd annual Fountain Fall Festival and Parade arrives Monday, Sept. 5 in Fountain. The Labor Day Parade begins at 10 a.m. Monday and will run along Main Street and Ohio Avenue. The Fall Festival opens at 10:30 a.m. at John Metcalf Park. Credit: Jazz Aspen Snowmass JAS Labor Day Experience SNOWMASS — The Jazz Aspen Snowmass Labor Day Experience is a popular three-day music festival on the grounds outside the Snowmass Village Recreation Center. This year's 31st annual lineup includes Leon Bridges, Chris Stapleton, Stevie Nicks, Little Big Town, Zach Bryan, St. Paul and the Broken Bones and more. The festival runs Friday, Sept. 2 to Sunday, Sept. 4. Tickets are sold at JazzAspenSnowmass.org. Credit: Pixar Putt Pixar Putt DENVER — Pop-up, open air mini-golf experience Pixar Putt has arrived in Denver. The experience is made up of 18 holes inspired by the stories, characters and icons from some of Disney and Pixar's most beloved films including \"Toy Story,\" \"The Incredibles,\" \"Monsters, Inc.,\" \"Finding Nemo,\" \"Coco,\" \"A Bug's Life,\" \"Wall-E,\" and \"Inside Out.\" Pixar Putt is staged at McGregor Square’s Rally Hotel beginning Saturday, Sept. 3 and running through Nov. 27. Credit: 9NEWS Nan Desu Kan AURORA — The three-day Japanese culture convention Nan Desu Kan is back this weekend at Gaylord Rockies Resort & Convention Center in Aurora. Since 1997, the event has showcased traditional Japanese arts, anime, cosplay, gaming, shopping, music, dance, voice actors, competitions, charity and more. Nan Desu Kan runs Friday, Sept. 2 through Sunday, Sept. 4. Check out the full lineup at NDKDenver.org . Credit: NPS Photo/J. Koch Bent’s Old Fort OTERO COUNTY — The public is invited to join the inhabitants of Bent’s Old Fort on Friday, Sept. 2 from 1 p.m. to 5:30 p.m. and Saturday, Sept. 3 from 8 a.m. to 5:30 p.m. to experience the sights and sounds of Bent, St. Vrain, & Company in 1847. There is no additional fee to participate in this special event. Regular park entrance fees apply. Bent’s Old Fort National Historic Site is located on Colorado Highway 194, eight miles east of La Junta. Credit: jerd nakata - stock.adobe.com Estes Park Labor Day Arts & Crafts Show ESTES PARK — The Estes Park Arts and Crafts Show brings over 100 artisans to downtown Estes Park every Labor Day weekend. This year's show runs from Saturday, Sept. 3 to Monday, Sept. 5 at Bond Park. The show, when combined with the shops and restaurants of downtown, make Estes Park a great weekend destination on the edge of Rocky Mountain National Park. Commonwheel Art Festival MANITOU SPRINGS — Manitou Springs' Memorial Park is the site of this weekend’s Commonwheel Artists Co-op 48th annual Labor Day Art Festival . The festival will be open from 10 a.m. to 5 p.m. Saturday, Sept. 3 to Monday, Sept. 5. There will be dozens of art vendors, live music, food options, beer garden and kids’ activities. Admission is free. Credit: digidreamgrafix - stock.adobe.com Windsor Cruise In Car Show WINDSOR — One of the largest car shows in northern Colorado will be held Sunday, Sept. 4 from 10 a.m. to 2 p.m. The Windsor Cruise In Car Show at Eastman Park will have categories in 20s and older, 30s, 40s, 50s, 60s, 70s, 80s, 90s and newer, trucks, and diamond-in-the-rough vehicles. There is no entry fee for car enthusiasts interested in stopping by, viewing the cars, meeting and mingling with the owners of the vehicles. Credit: Lukas Gojda - stock.adobe.com Four Corners Motorcycle Rally DURANGO — Durango, which serves as a gateway to the world famous Million Dollar Highway, is the home of this weekend's three-day Four Corners Motorcycle Rally . There will be races, stunt shows, live music, bike shows and more. Visit FourCornersMotorcycleRally.com to see a complete event schedule. Credit: Rotary Club of Vail Vail Duck Race VAIL — The Vail Rotary Club is hosting its annual rubber duck race at 3 p.m. this Sunday, Sept. 4. The club will send about 15,000 ducks down Gore Creek. The race will begin at the Covered Bridge and end at the Vail Rotary International Bridge. The owner of the first duck that enters the chute will win $5,000. This event serves as a fundraiser for the Vail Rotary which supports many Vail-area organizations. Ducks are available for adoption online . Credit: Steve Lovegrove - stock.adobe.com Ouray County Rodeo RIDGWAY — Ouray County is ready for rodeo! The 2022 Ouray County Labor Day Rodeo will be held Monday, Sept. 5 with a parade at 10 a.m., BBQ in the Park at 11 a.m. and CPRA Rodeo at 1 p.m. Active military and children under six receive free admission . Labor Day Weekend Rodeo TRINIDAD — The Trinidad Round-Up Association's 112 th an nual Labor Day Weekend is a three -day celebration at the Las Animas County Fairgrounds. The weekend includes two rodeo performances , Saturday night dance, performance by the Westernaires , beer garden, expo, concessions , vendors, stick horse races, kids ’ nickel scramble and more. The L abor Day Pa rade steps off at 9 a.m. Monday, Sept. 5 in downtown Trinidad. Credit: kojihirano - stock.adobe.com Yampa Valley Crane Fest STEAMBOAT SPRINGS — The 11th annual Yampa Valley Crane Festival will be held Thursday, Sept. 1 to Sunday, Sept. 4 in Steamboat Springs, Hayden and Craig. The festival features four-days of mostly free events, but some activities including crane-viewing shuttles and those with limited space, require advance registration and small fee. Organizers say the best way to view cranes are the four guided crane-viewing events throughout the festival. This year’s event also will have speakers, workshops, educational displays, story-telling event, aerial arts dancers, walks, coloring contest, children and family activities and more. See the full schedule at ColoradoCranes.org . Credit: Colorado National Speedway Colorado National Speedway DACONO — Colorado National Speedway will hold two nights of Labor Day weekend racing. Short track NASCAR-sanctioned racing is scheduled for Saturday, Sept. 3 and Sunday, Sept. 4 with post-race firework shows. Tickets are available at the box office or ColoradoSpeedway.com . Credit: Rocky Mountain Vibes Rocky Mountain Vibes vs. Northern Colorado Owlz COLORADO SPRINGS — The Rocky Mountain Vibes host rival Northern Colorado Owlz for three games at UCHealth Park. Thursday, Sept. 1 is Ladies Nights and Friday, Sept. 2 has post-game fireworks. Credit: Michael Pierce Photography Four Corners Folk Festival PAGOSA SPRINGS — The 26th annual Four Corners Folk Festival runs Friday, Sept. 2 to Sunday, Sept. 4 with live performances from Yonder Mountain String Band, Darrell Scott Trio, Heartless Bastards, Dirtwire, Gangstagrass, Amy Helm, William Prince and more. Credit: Amy Harris/Invision/AP Trey Anastasio of Phish Phish COMMERCE CITY — In what's become a tradition dating back to 2011 , Phish returns to Colorado over Labor Day weekend. Known for its improvisational style and dedicated fan base, the jam band will play at Dick’s Sporting Good Park on Thursday, Sept. 1, Friday, Sept. 2, Saturday, Sept. 3, and Sunday, Sept. 4. Phish's run in Colorado ends the band's 2022 summer tour. Tickets are sold at Ticketmaster.com . Credit: Kizzy O'Neal Singer-songwriter Jack Johnson will perform at Ruoff Music Center in Noblesville, Indiana, on Sunday, July 3, 2022. Jack Johnson GREENWOOD VILLAGE — Singer-songwriter Jack Johnson will bring his 2022 tour to Fiddler's Green Amphitheatre on Wednesday, Aug. 31 and Thursday, Sept. 1, with Ziggy Marley & the Melody Makers. Johnson's tour kicked off in June and wraps in October. Fiddler's Green Amphitheatre is the largest outdoor amphitheater in the Denver metro area. Credit: Colorado Tourism Office Telluride Film Festival TELLURIDE — The 49th annual Telluride Film Festival is this Labor Day weekend. The prestigious event features many films premiering for the first time in North America. From Friday, Sept. 2 to Mon day, Sept. 5, more than 50 programs will be screened in ten venues. The lineup of the Telluride Film Festival will not be revealed until the weekend. Credit: Hershey Entertainment Red Rocks DENVER — There is no better venue for live music in the country than Colorado's Red Rocks Amphitheatre! The Red Rocks 2022 concert schedule is still growing and even features some concerts postponed from 2020. Thursday, Sept. 1 - Robert Plant, Alison Krauss Friday, Sept. 2 - Nine Inch Nails Saturday, Sept. 3 - Nine Inch Nails Sunday, Sept. 4 - Kidz Bop Live Monday, Sept. 5 - Shaky Graves, Sierra Ferrell Credit: oles_photo - stock.adobe.com Movies this weekend Without any major releases this weekend, most major movie theater chains have declared Saturday, Sept. 3 as \"National Cinema Day\" with special deals and discounts. AMC, Cinemark and Regal Cinemas are participating, as are all major film studios. In participating theaters, tickets will be no more than $3 for every showing, in every format. RELATED: Coming to a theater near you: $3 movie tickets for one day Last weekend's box office The Invitation — $6.8 million Bullet Train — $5.6 million Beast — $4.8 million Top Gun: Maverick — $4.7 million Dragon Ball Super: Super Hero — 4.6 million DC League of Super-Pets — $4.1 million Three Thousand Years of Longing — $2.9 million Minions: The Rise of Gru — $2.7 million Thor: Love and Thunder — $2.6 million Where the Crawdads Sing — $2.3 million RELATED: Back to normal at the movies? What to expect this fall RELATED: 'The Invitation' tops tepid weekend at box office > Would you like to see your favorite Colorado festival, fair, expo, concert, drama, musical, ballet, run or event listed in 9Things? Send it to alexander.kirk@9news.com . 'A Taste of Colorado' — Denver Labor Day weekend tradition 1/22 A Taste of Colorado 2/22 A Taste of Colorado 3/22 Evan Semón Photography; A Taste of Colorado 4/22 A Taste of Colorado 5/22 A Taste of Colorado 6/22 A Taste of Colorado 7/22 A Taste of Colorado 8/22 A Taste of Colorado 9/22 A Taste of Colorado 10/22 A Taste of Colorado 11/22 A Taste of Colorado 12/22 A Taste of Colorado 13/22 A Taste of Colorado 14/22 A Taste of Colorado 15/22 A Taste of Colorado 16/22 A Taste of Colorado 17/22 A Taste of Colorado 18/22 A Taste of Colorado 19/22 A Taste of Colorado 20/22 A Taste of Colorado 21/22 A Taste of Colorado 22/22 A Taste of Colorado 1 / 22 × A Taste of Colorado More > Top stories curated daily just for you! Sign up for the 9NEWSLETTER to get can’t-miss stories, Next and Broncos content, weather and more delivered right to your inbox. SUGGESTED VIDEOS: Colorado Guide MORE WAYS TO GET 9NEWS Subscribe to our daily 9NEWSLETTER Download the 9NEWS APP iTunes: http://on9news.tv/itunes Google Play: http://on9news.tv/1lWnC5n HOW TO ADD THE 9NEWS APP TO YOUR STREAMING DEVICE ROKU: add the channel from the ROKU store or by searching for KUSA. For both Apple TV and Fire TV, search for \"9news\" to find the free app to add to your account. Another option for Fire TV is to have the app delivered directly to your Fire TV through Amazon."
    },
    {
        "_id": "f06f8cc035b04bd1158e4198281915a4",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": true
        },
        "category_id": "05",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 127,
        "title": "Up Late with Ben Harvey: Why Troy Mercanti needs to start an OnlyFans account",
        "author": {
            "name": "Ukrainska Pravda",
            "published_date": "2022-08-25 18:53:49",
            "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
        },
        "thumbnail_url": "https://i.ibb.co/dr4TRY4/unsplash-Eh-Tc-C9s-YXsw-21.png",
        "image_url": "https://i.ibb.co/vz5K0FB/unsplash-Eh-Tc-C9s-YXsw-10.png",
        "details": "On Thursday night’s episode of Up Late, Ben Harvey has suggested Troy Mercanti start an OnlyFans account if he wishes to challenge anti-consorting laws. The notorious bikie will fight allegations that he broke WA’s stringent anti-consorting and insignia laws — but is also watching a High Court challenge to the regulations which the State Government have touted have the nation’s toughest against outlaw motorcycle gang members. The long-time one per center was not in court on Wednesday when the not guilty pleas were entered. WATCH UP LATE IN THE VIDEO PLAYER ABOVE But his lawyer Paul Holmes was, who revealed that Mercanti’s defence will be on two fronts — against elements of the alleged offence, and the legislation itself. Mercanti was charged with the two offences outside an Italian restaurant in front of shocked onlookers earlier this year. According to eyewitnesses, Mercanti — dressed in a T-shirt and shorts — was having lunch with long-time friend John Kizon at Mt Hawthorn’s Lupo Lab when more than a dozen officers from the gang crime squad descended and asked him to step outside. Soon afterwards, he was told he was being charged via summons with displaying gang insignia, which was prohibited under sweeping laws that came into effect a few months ago. Earlier the same week, Mercanti was hit with a dispersal notice by police while picking up a friend at the airport. Mercanti’s case was adjourned until October to be allocated a trial date. On Up Late, Harvey warned fighting in court may get expensive for Mercanti, and suggested a way he may be able to come up with the cash. Harvey may have gotten the idea after it was this week revealed that Dhakota Williams — the 21-year-old daughter of slain underworld king Carl Williams started an OnlyFans account. “If it’s good enough for the wife and daughter of slain gangland boss Carl Williams then it’s gotta be good enough for Troy Mercanti,” Harvey says. “See Troy’s OnlyFans page for exclusive tips for how a modern outlaw can best accessorise… find out why black and white are the only colours you need in your wardrobe… a showcase of latest leather trends… tips on keeping healthy. “And exclusively for OnlyFans subscribers... an inside look at the man who put the soft into soft serve, how he relaxes listing to 80s glam-rock and some cosplay as a Lego spaceman.”"
    },
    {
        "_id": "cd2b53655737cc4077542baea9f8f75d",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": true
        },
        "category_id": "02",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 700,
        "title": "Javascript for Beginners Learn by Doing Practical Exercises",
        "author": {
            "name": "Daniel Deangelo",
            "published_date": "2022-08-30 20:02:52",
            "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
        },
        "thumbnail_url": "https://images.unsplash.com/photo-1505238680356-667803448bb6?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80",
        "image_url": "https://images.unsplash.com/photo-1505238680356-667803448bb6?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80",
        "details": "Looking for a quick and easy way to learn Javascript?

        This course if for absolute beginners, and it is an introduction to the major components of javascript. By learning the bigger things in Javascript, you will be able to know how to put the remaining pieces together and will be able to get into advanced courses more prepared. 

I'm not going to start this course with False promises. 

        At the end of this course, you will NOT become an expert and nor will you in any other course. To become an expert in Javascript or any other programming language you need many hours of practice and experience; more like years of practice and experience. 

My PROMISE to you. 

        My promise to you is that all the lessons you will see here, will get engraved in your brain better than in any other course, why? My approach is the practice approach which is the number one key to learning any programming language or technical course faster and easier."
    },
    {
        "_id": "4e6092d54c18fbd89ad59e88a1e87fbb",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": false
        },
        "category_id": "07",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 300,
        "title": "Joe Biden announces $3B in new military aid to Ukraine",
        "author": {
            "name": "",
            "published_date": "2022-08-24 22:30:00",
            "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
        },
        "thumbnail_url": "https://i.ibb.co/QnwC4sG/unsplash-Eh-Tc-C9s-YXsw-11.png",
        "image_url": "https://i.ibb.co/M23fhxm/unsplash-Eh-Tc-C9s-YXsw.png",
        "details": "Washington, Aug 24 (Prensa Latina) President Joe Biden has announced he will allot nearly billion in military aid to Kyiv – the biggest US package so far since the beginning of the Russian military…"
    },
    {
        "_id": "7c4dfea0fafddc813673282a428429b7",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": true
        },
        "category_id": "01",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 0,
        "title": "React Tutorial and Projects Course (2022)",
        "author": {
            "name": "Reuters",
            "published_date": "2022-08-25 03:09:16",
            "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
        },
        "thumbnail_url": "https://images.unsplash.com/photo-1591267990532-e5bdb1b0ceb8?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=827&q=80",
        "image_url": "https://images.unsplash.com/photo-1591267990532-e5bdb1b0ceb8?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=827&q=80",
        "details": "React was released by Facebook's web development team in 2013 as a view library. React is one of the best choices for building modern web applications. React has a slim API, a robust and evolving ecosystem and a great community. In this course we will be learning React by creating various projects.If you want to learn more than just same old tutorial and instead create interesting projects using React.js this course is for you. During the course we will also cover redux-toolkit, which is the latest flavor of good old redux and build an interesting project with it. After each tutorial section we will build few projects to put see theory in action. You are not expected to build all projects, but the more course projects, you will complete the easier it's going to be to build your own applications, since you will know how to implement certain features in react."
    },
    {
        "_id": "30af81e91ab3eafc0bcae0de62f55d5c",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": true
        },
        "category_id": "01",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 320,
        "title": "Full React Js Course: React JS, Redux, Hooks and Context",
        "author": {
            "name": "John Pike",
            "published_date": "2022-08-25 07:35:11",
            "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
        },
        "thumbnail_url": "https://images.unsplash.com/photo-1627398242454-45a1465c2479?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=774&q=80",
        "image_url": "https://images.unsplash.com/photo-1627398242454-45a1465c2479?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=774&q=80",
        "details": "People's Daily Online (Xinhua) 08:16, August 25, 2022 The United States has committed more than 13.5 billion dollars in security assistance to Ukraine since President Joe Biden took office. WASHINGTON, Aug. 24 (Xinhua) -- The United States on Wednesday announced an additional tranche of security assistance to Ukraine worth nearly 3 billion U.S. dollars, the largest one-time weapons aid to Kiev that came as the Russia-Ukraine conflict reached the half-year mark. According to a breakdown by the Department of Defense (DoD), items in the newly-announced package include six additional National Advanced Surface-to-Air Missile Systems (NASAMS) with additional munitions for NASAMS, up to 245,000 rounds of 155mm artillery ammunition, up to 65,000 rounds of 120mm mortar ammunition, up to 24 counter-artillery radars, Puma Unmanned Aerial Systems (UAS) and support equipment for Scan Eagle UAS systems,   Vampire   counter-UAS systems, as well as laser-guided rocket systems."
    },
    {
        "_id": "df11ff9feefc37613cc3a4486ce02151",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": false
        },
        "category_id": "02",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 552,
        "title": "JavaScript from Beginner to Expert",
        "author": {
            "name": "system",
            "published_date": "2022-08-27 05:38:02",
            "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
        },
        "thumbnail_url": "https://images.unsplash.com/photo-1472437774355-71ab6752b434?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=774&q=80",
        "image_url": "https://images.unsplash.com/photo-1472437774355-71ab6752b434?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=774&q=80",
        "details": "Would you like to learn JavaScript and become a good earning front-end developer?

        Save your precious time by buying this course. You will learn how to program in JavaScript in a fast and easy way!
        
        The total length of the JavaScript course is over 12 hours! You will learn theory and you will also gain lots of practice. During the course, I will explain to you how to write real-life applications, like galleries with thumbnails, image sliders, etc.
        
        I will do everything so that you understand JavaScript. After this course, you will always understand the code you are writing. You will understand all concepts and create your own applications!
        
        After my course, you can become a front-end developer. JavaScript is a very demanded language by employers.
        
        The course is designed for people who don't have any knowledge about programming or want to truly understand JavaScript. It doesn't matter if you have never written any programs or you have no idea about programming... After my course, all this will change. You will bust the myth that programming is a difficult thing only for the few!"
    },
    {
        "_id": "acb9b6785b62698fc6130db7615965e1",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": true
        },
        "category_id": "03",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 879,
        "title": "Step-by-step HTML and CSS for Absolute Beginners",
        "author": {
            "name": "RTTNews",
            "published_date": "2022-08-25 11:53:13",
            "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
        },
        "thumbnail_url": "https://images.unsplash.com/photo-1563206767-5b18f218e8de?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=869&q=80",
        "image_url": "https://images.unsplash.com/photo-1563206767-5b18f218e8de?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=869&q=80",
        "details": "Want to learn how to create webpages, but feeling intimidated by HTML and CSS? Not sure where to start? Step-by-step HTML and CSS for Absolute Beginners is a comprehensive and friendly course designed for beginners with NO previous coding or programming experience.

        HTML (HyperText Markup Language) and CSS (Cascading Style Sheets) are the building blocks of the web. If you've ever looked at a website, you've seen HTML and CSS in action!
        
        
        Whether you want to make changes to your website's template, create new webpages from scratch, or just understand what you're doing when you cut-and-paste embed codes from sites like YouTube or SlideShare — understanding HTML and CSS makes it possible."
    },
    {
        "_id": "be44c843d61859cc0b87cae85c55f9db",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": true
        },
        "category_id": "01",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 231,
        "title": "React js. From the beginning. w/ Redux and React Router",
        "author": {
            "name": "Kumar Natasha",
            "published_date": "2022-08-26 12:15:36",
            "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
        },
        "thumbnail_url": "https://images.unsplash.com/photo-1485856407642-7f9ba0268b51?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80",
        "image_url": "https://images.unsplash.com/photo-1485856407642-7f9ba0268b51?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80",
        "details": "Starting with Angular 1 in 2010, JavaScript frameworks exploded onto the scene and are required by virtually every large website on the Internet. React, which appeared a few years later in 2013  has become the dominant tool in that group. What does that mean for you? You can learn to use the same front-end framework used by Facebook, Amazon, Netflix, BBC, Airbnb, and Ebay, to name a few. And you won't just learn how to use it, but you'll learn the fundamentals around it.

        What I need from you:
        
        I need you to know JavaScript, CSS, and HTML.
        
        It's not required to use React, but React makes very heavy use of ES6 (the 2015 update to JavaScript), so the course will use ES6 after the first main section. I will briefly mention how it works as needed, and add a supplemental section that covers those parts.
        
        I need you know how to navigate your computer, not be afraid of the terminal, and ask questions as you have them!"
    },
    {
        "_id": "1b03149c50f1bec662062d930bf46489",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": true
        },
        "category_id": "02",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 546,
        "title": "JavaScript: Understanding the Weird Parts",
        "author": {
            "name": "The Philadelphia Inquirer",
            "published_date": "2022-08-30 22:00:00",
            "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
        },
        "thumbnail_url": "https://images.unsplash.com/photo-1587620962725-abab7fe55159?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1031&q=80",
        "image_url": "https://images.unsplash.com/photo-1587620962725-abab7fe55159?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1031&q=80",
        "details": "Javascript is the language that modern developers need to know, and know well. Truly knowing Javascript will get you a job, and enable you to build quality web and server applications. NOTE: This course includes information on ECMAScript 6 (ES6) the next version of Javascript!
        
        In this course you will gain a deep understanding of Javascript, learn how Javascript works under the hood, and how that knowledge helps you avoid common pitfalls and drastically improve your ability to debug problems. You will find clarity in the parts that others, even experienced coders, may find weird, odd, and at times incomprehensible. You'll learn the beauty and deceptive power of this language that is at the forefront of modern software development today.
        
        This course will cover such advanced concepts as objects and object literals, function expressions, prototypical inheritance, functional programming, scope chains, function constructors (plus new ES6 features), immediately invoked function expressions (IIFEs), call, apply, bind, and more.
        
        We'll take a deep dive into the source code of popular frameworks such as jQuery and Underscore to see how you can use your understanding of Javascript to learn (and borrow) from other's good code.
        
        Finally, you'll learn the foundations of how to build your own Javascript framework or library.
        
        What you'll learn in this course will make you a better Javascript developer, and improve your abilities in AngularJS, NodeJS, jQuery, React, Ember, MongoDB, and all other Javascript-based technologies!
        
        Learn to love Javascript, and code in it well.
        
        Note: In this course you'll also get downloadable source code. You will often be provided with 'starter' code, giving you the base for you to start writing your code, and 'finished' code to compare your code to."
    },
    {
        "_id": "7f5b80c1cdd4df0111918883eae07349",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": true
        },
        "category_id": "03",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 1870,
        "title": "Build Websites from Scratch with HTML & CSS",
        "author": {
            "name": "system",
            "published_date": "2022-08-24 23:15:00",
            "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
        },
        "thumbnail_url": "https://images.unsplash.com/photo-1610018556010-6a11691bc905?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80",
        "image_url": "https://images.unsplash.com/photo-1610018556010-6a11691bc905?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80",
        "published_date": "2022-08-24 18:00:00",
        "details": "With this online course—from one of Udemy's top web design instructors, Brad Hussey—you will learn HTML & CSS by building beautiful, modern and responsive websites! You will have a strong foundation in web development that will enable you to start creating any website you can imagine.

        By the end of this course, you will be competent in HTML & CSS and be able to create your own professional-grade website from scratch – no prior experience required! You will also have the skillset necessary to continue learning about web development and advancing your career.
        
        Sign up for this online course today and start building your very own websites!"
    },
    {
        "_id": "17d266b79d2fcd850cd4d983c3aeb95f",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": true
        },
        "category_id": "07",
        "rating": {
            "number": 4.2,
            "badge": "Excellent"
        },
        "total_view": 354,
        "title": "‘Self-obsessed liar’: Meghan mocked for Mandela story",
        "author": {
            "name": "Presstv",
            "published_date": "2022-08-30 17:44:16",
            "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
        },
        "thumbnail_url": "https://i.ibb.co/j86wjDW/unsplash-Eh-Tc-C9s-YXsw-20.png",
        "image_url": "https://i.ibb.co/hxG29nr/unsplash-Eh-Tc-C9s-YXsw-9.png",
        "details": "Meghan Markle's Nelson Mandela story continues to unravel after the only South African cast member of 'The Lion King' said he was \"baffled\" by her suggestion that he told her his country had \"rejoiced\" when she married Prince Harry. The former Suits actress recalled an encounter she had at the 2019 London premiere of 'The Lion King' with an actor from South Africa who made a comparison to her wedding with Prince Harry and Nelson Mandela. “He looked at me, and he’s just like light. He said, ‘I just need you to know: When you married into this family, we rejoiced in the streets the same we did when Mandela was freed from prison,’” she said during an interview with The Cut. The Daily Mail revealed Dr John Kani, who claims he was the only South African actor in the film, said he did not attend the premiere and had never met the Duchess of Sussex. \"I have never met Meghan Markle,\" he told the MailOnline. \"This seems like something of a faux pas by her. I have I have never met the duchess at all. I am the only South African member of the cast and I did not attend the premiere in London. \"The only South African was me playing Rafiki. But I did not go to the opening in Leicester Square as I didn't have the time to do that. It just may be a mis-remembering on her side. \"It is baffling me.\" Nelson Mandela’s grandson said he was “surprised” when he heard Ms Markle compare her wedding with Prince Harry to his grandfather being freed from prison. He said it “cannot be equated to as the same\". The Duchess of Sussex was met with heavy criticism online after she told the story to The Cut. \"The damage her and her husband are doing to the Queen and the Royal Family is incalculable... these two hypocritical, self-obsessed liars are in the end going to be ignored,\" said Nigel Farage"
    },
    {
        "_id": "61f9ce168f7b15aadecb1d1fc80c72f0",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": true
        },
        "category_id": "05",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 100,
        "title": "California to phase out sales of gas-powered cars",
        "author": {
            "name": "system",
            "published_date": "2022-08-26 00:37:24",
            "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
        },
        "thumbnail_url": "https://i.ibb.co/L507x2V/unsplash-Eh-Tc-C9s-YXsw-14.png",
        "image_url": "https://i.ibb.co/tKsvCyR/unsplash-Eh-Tc-C9s-YXsw-3.png",
        "details": "Associated Press  Six months after Russia's invasion of Ukraine, President Joe Biden announced Wednesday that he is sending $2.98 billion in new military aid to Ukraine that will provide longer-term weapons and training to enable forces there to fight for years to come. In a statement, Biden said the aid will allow Ukraine to acquire air defense systems, artillery systems and munitions, drones and other equipment 'to ensure it can continue to defend itself over the long term.' The announcement comes as Ukraine is celebrating its 1991 declaration of independence from the Soviet Union."
    },
    {
        "_id": "61f9ce168f7b15aadecb1d1fc80c72f7",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": false
        },
        "category_id": "04",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 100,
        "title": "Angular - The Complete Guide (2022 Edition)",
        "author": {
            "name": "system",
            "published_date": "2022-08-26 00:37:24",
            "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
        },
        "thumbnail_url": "https://images.unsplash.com/photo-1566837945700-30057527ade0?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80",
        "image_url": "https://images.unsplash.com/photo-1566837945700-30057527ade0?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80",
        "details": "Join the most comprehensive and bestselling Angular course on Udemy and learn all about this amazing framework from the ground up, in great depth!

        This course starts from scratch, you neither need to know Angular 1 nor Angular 2!
        
        Angular 13 simply is the latest version of Angular 2, you will learn this amazing framework from the ground up in this course!
        
        Join the most comprehensive, popular and bestselling Angular course on Udemy and benefit not just from a proven course concept but from a huge community as well! 
        
        From Setup to Deployment, this course covers it all! You'll learn all about Components, Directives, Services, Forms, Http Access, Authentication, Optimizing an Angular App with Modules and Offline Compilation and much more - and in the end: You'll learn how to deploy an application!
        
        But that's not all! This course will also show you how to use the Angular CLI and feature a complete project, which allows you to practice the things learned throughout the course!
        
        And if you do get stuck, you benefit from an extremely fast and friendly support - both via direct messaging or discussion. You have my word! ;-)"
    }
]