[
    {
        "_id": "0282e0e58a5c404fbd15261f11c2ab6a",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": true
        },
        "category_id": "01",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 488,
        "title": "Modern React with Redux",
        "author": {
            "name": "Jimmy Dane",
            "published_date": "2022-08-24 17:27:34",
            "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
        },
        "thumbnail_url": "https://images.unsplash.com/photo-1633356122102-3fe601e05bd2?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80",
        "image_url": "https://images.unsplash.com/photo-1633356122102-3fe601e05bd2?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80",
        "details": "Congratulations!  You've found the most popular, most complete, and most up-to-date resource online for learning React and Redux! Thousands of other engineers have learned React and Redux, and you can too. This course uses a time-tested, battle-proven method to make sure you understand exactly how React and Redux work, and will get you a new job working as a software engineer or help you build that app you've always been dreaming about. The difference between this course and all the others: you will understand the design patterns used by top companies to build massively popular web apps. React is the most popular Javascript library of the last five years, and the job market is still hotter than ever. Companies large and small can't hire engineers who understand React and Redux fast enough, and salaries for engineers are at an all time high.  It's a great time to learn React.This course features hundreds of videos with dozens of custom diagrams to help you understand how React and Redux work.  No prior experience with either is necessary. Through tireless, patient explanations and many interesting practical examples, you'll learn the fundamentals of building dynamic and live web apps using React. Each topic included in this course is added incrementally, to make sure that you have a solid foundation of knowledge.  You'll find plenty of discussion added in to help you understand exactly when and where to use each feature of React and Redux.My guarantee to you: there is no other course online that teaches more features of React and Redux.  This is the most comprehensive resource there is."
    },
    {
        "_id": "0282e0e58a5c404fbd15261f11c2ab6b",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": true
        },
        "category_id": "03",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 488,
        "title": "HTML and CSS for Beginners - Build a Website & Launch ONLINE",
        "author": {
            "name": "Jimmy Dane",
            "published_date": "2022-08-24 17:27:34",
            "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
        },
        "thumbnail_url": "https://images.unsplash.com/photo-1589149098258-3e9102cd63d3?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=739&q=80",
        "image_url": "https://images.unsplash.com/photo-1589149098258-3e9102cd63d3?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=739&q=80",
        "details": "This step-by-step HTML and CSS course will help you learn coding fast and with an instructor that really cares about his students. Learning to code will help you make more money in your job, or even find a better job, or better yet, get a nice job as a web developer. HTML and CSS are the foundations you need to get into any programming language. Everything new is hard but programming doesn't have to be. Learning HTML and CSS is the first stepping stone you need to start programming . This course was created with a dummy approach, meaning even people with difficulty learning technology will learn. I also guaranteed that even small kids can learn its material. You will feel like you are beside me when taking the lecture, we will be buddies until the end of this course and even after. After this course, you will have a good understanding of HTML and CSS and will be able to start your journey into the beautiful world of programming."
    },
    {
        "_id": "f69a695f037cd9484cecaea37ca71011",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": true
        },
        "category_id": "01",
        "rating": {
            "number": 4.8,
            "badge": "Excellent"
        },
        "total_view": 400,
        "title": "React - The Complete Guide",
        "author": {
            "name": "Jennifer Wood",
            "published_date": "2022-08-30 16:38:45",
            "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
        },
        "thumbnail_url": "https://images.unsplash.com/photo-1569748130764-3fed0c102c59?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80",
        "image_url": "https://images.unsplash.com/photo-1569748130764-3fed0c102c59?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80",
        "details": "This course is fully up-to-date with React 18 (the latest version of React)! It was completely updated and re-recorded from the ground up - it teaches the very latest version of React with all the core, modern features you need to know! This course also comes with two paths which you can take: The complete path (full >40h course) and the summary path (~4h summary module) - you can choose the path that best fits your time requirements! :-) React.js is THE most popular JavaScript library you can use and learn these days to build modern, reactive user interfaces for the web. This course teaches you React in-depth, from the ground up, step by step by diving into all the core basics, exploring tons of examples and also introducing you to advanced concepts as well. You'll get all the theory, tons of examples and demos, assignments and exercises and tons of important knowledge that is skipped by most other resources - after all, there is a reason why this course is that huge! :) And in case you don't even know why you would want to learn React and you're just here because of some ad or the algorithm - no worries: ReactJS is a key technology as a web developer and in this course I will also explain WHY it's that important!"
    },
    {
        "_id": "f69a695f037cd9484cecaea37ca71012",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": true
        },
        "category_id": "02",
        "rating": {
            "number": 4.3,
            "badge": "Excellent"
        },
        "total_view": 400,
        "title": "Javascript for Beginners",
        "author": {
            "name": "Jennifer Wood",
            "published_date": "2022-08-30 16:38:45",
            "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
        },
        "thumbnail_url": "https://images.unsplash.com/photo-1592609931095-54a2168ae893?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80",
        "image_url": "https://images.unsplash.com/photo-1592609931095-54a2168ae893?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80",
        "details": " As a business guy I have no place in programming.  Ten years ago you could have gotten away with that statement. Today you say that to your colleagues and they scoff at you before they go back to their computers to fix real problems and do real work. If you want to do something useful start by learning Javascript . In these days when the browser is central to all computer use knowing  the language of the browser  is the most important step. A few years ago Javascript potential was uncertain and many programmers considered it useless. These days however competent programmers have identified Javascript real potential and uses and it has gone from a toy language to the main language of the browser. It has become one of the most useful languages of this era. Every developer needs at least a basic understanding of Javascript. A developer who knows Javascript is the rockstar of the company and is in constant demand by employers. Our online Javascript course will get you started by teaching all the essential aspects of coding in Javascript. So... what's it gonna be? Do you want to supercharge your career and be in constant demand by employers? Do you want to learn how to create dynamic and innovative Javascript documents? Start programming today with our Javascript course for Beginners training and take control of your career."
    },
    {
        "_id": "11468ed61aee84de492a8b04158a22f9",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": false
        },
        "category_id": "03",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 980,
        "title": "Joe Biden announces $3 billion in Ukraine weapons aid",
        "author": {
            "name": "system",
            "published_date": "2022-08-24 23:15:00",
            "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
        },
        "thumbnail_url": "https://images.unsplash.com/photo-1524666643752-b381eb00effb?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=871&q=80",
        "image_url": "https://images.unsplash.com/photo-1524666643752-b381eb00effb?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=871&q=80",
        "details": "You can launch a new career in web development today by learning HTML & CSS. You don't need a computer science degree or expensive software. All you need is a computer, a bit of time, a lot of determination, and a teacher you trust. I've taught HTML and CSS to countless coworkers and held training sessions for fortune 100 companies. I am that teacher you can trust. Don't limit yourself by creating websites with some cheesy site-builder tool. This course teaches you how to take control over your webpages by using the same concepts that every professional website is created with.This course does not assume any prior experience. We start at square one and learn together bit by bit. By the end of the course you will have created (by hand) a website that looks great on phones, tablets, laptops, and desktops alike.In the summer of 2020 the course has received a new section where we push our website live up onto the web using the free GitHub Pages service; this means you'll be able to share a link to what you've created with your friends, family, colleagues and the world!"
    },
    {
        "_id": "11468ed61aee84de492a8b04158a22f0",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": false
        },
        "category_id": "01",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 980,
        "title": "Complete React Developer in 2022",
        "author": {
            "name": "system",
            "published_date": "2022-08-24 23:15:00",
            "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
        },
        "thumbnail_url": "https://images.unsplash.com/photo-1552308995-2baac1ad5490?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80",
        "image_url": "https://images.unsplash.com/photo-1552308995-2baac1ad5490?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80",
        "details": "Just FULLY updated and re-recorded with all new React features for 2022 (React v18)! Join a live online community of over 600,000+ developers and a course taught by industry experts that have actually worked both in Silicon Valley and Toronto with React.js. Using the latest version of React (React 18), this course is focused on efficiency. Never spend time on confusing, out of date, incomplete tutorials anymore. Graduates of Andrei’s courses are now working at Google, Tesla, Amazon, Apple, IBM, JP Morgan, Facebook, + other top tech companies. We guarantee you this is the most comprehensive online resource on React. This project based course will introduce you to all of the modern toolchain of a React developer in 2022. Along the way, we will build a massive e-commerce application similar to Shopify using React, Redux, React Hooks, React Suspense, React Router, GraphQL, Context API, Firebase, Redux-Saga, Stripe + more. This is going to be a full stack app (MERN stack), using Firebase. The curriculum is going to be very hands on as we walk you from start to finish of releasing a professional React project all the way into production. We will start from the very beginning by teaching you React Basics and then going into advanced topics so you can make good decisions on architecture and tools on any of your future ReactJS projects.All code is going to be provided step by step and even if you don’t like to code along, you will get access to the the full master project code so anyone signed up for the course will have their own project to put on their portfolio right away."
    },
    {
        "_id": "2e78e5e0310c2e9adbb6efb1a263e745",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": true
        },
        "category_id": "02",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": null,
        "title": "1 Hour JavaScript",
        "author": {
            "name": null,
            "published_date": "2022-08-30 15:00:04",
            "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
        },
        "thumbnail_url": "https://plus.unsplash.com/premium_photo-1661692759400-15aa4e2de6c3?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80",
        "image_url": "https://plus.unsplash.com/premium_photo-1661692759400-15aa4e2de6c3?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80",
        "details": "Have you ever wanted to learn how to code but didn't know where to start? This is a fantastic course to start. Not only is JavaScript easy to learn but it is in demand? If you take this course you will start the fantastic process of learning to code which will lead you to a better life. Coding is one of the most in demand skills if you can code you have a job.The best part is that this is for complete beginners! Coding is a fantastic career to get into and this is the first course you should take. All web developers start with JavaScript and it is by far the easiest language to learn. JavaScript is one of the most prominent languages out there. When JavaScript first came out, it was really basic but now it's the building block of almost any web application. JavaScript developers will always be in demand. Just think of all of the things you can do in 1 hour and imagine learning a whole new skill. That's why these 1 hour lessons are so valuable. Take a look at the reviews, they speak for themselves.What are you waiting for, enroll today."
    },
    {
        "_id": "a713ee936ff5574273f0f769f5c5b20e",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": true
        },
        "category_id": "03",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 111,
        "title": "1 Hour CSS",
        "author": {
            "name": "system",
            "published_date": null,
            "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
        },
        "thumbnail_url": "https://images.unsplash.com/photo-1572985025058-f27aeca1b8bf?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=871&q=80",
        "image_url": "https://images.unsplash.com/photo-1572985025058-f27aeca1b8bf?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=871&q=80",
        "details": "Have you ever wanted to learn to code but don't know where to start? Learning how to code can get you a better job and lead to a better future. In this tutorial series you get to learn about CSS. CSS is the number design language for the web. CSS is easy to learn and it is used in most web development today. This course is a 1 hour course of action packed material. By the end of it you will have a firm understanding of the concepts of CSS.The best part is that this is for complete beginners! Coding is a fantastic career to get into and this is the first course you should take. All web developers start with CSS and it is by far the easiest language to learn. CSS stands for cascading style sheets and it is the what makes websites look good. Before CSS, websites didn't look good at all. Just think of all of the things you can do in 1 hour and imagine learning a whole new skill. That's why these 1 hour lessons are so valuable. Take a look at the reviews, they speak for themselves.What are you waiting for, enroll today."
    },
    {
        "_id": "e342b6c0c8efc8ca9e811991dc8a7900",
        "others_info": {
            "is_todays_pick": true,
            "is_trending": false
        },
        "category_id": "04",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 733,
        "title": "The Modern Angular Bootcamp",
        "author": {
            "name": "Theo Minh Châu",
            "published_date": "2022-08-25 06:03:00",
            "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
        },
        "thumbnail_url": "https://images.unsplash.com/photo-1561883088-039e53143d73?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80",
        "image_url": "https://images.unsplash.com/photo-1561883088-039e53143d73?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80",
        "details": "If you want to build large, scalable apps, Angular is the Javascript framework to learn! Angular has been under development by Google for nearly a full decade.  It has one purpose: scale up to gracefully handle the largest and most complex web apps around.  If you want to build a big app, Angular is the way to go.  Every other course online around Angular shows you how to use the basic syntax and features of Angular, but only this course will show you how to build large, professional projects using Angular. Mastering Angular by reading the documentation alone is challenging.  The official documentation always offers multiple ways to achieve any simple task, but never clarifies what the best way to do something is.  In this course, you will gain a fundamental understanding of the best way to achieve any goal with Angular, along with an explanation of the pros and cons of each possible approach.Top companies are hungry for Angular developers.  You've probably heard of the crazy salaries being offered for front-end developers.  The average starting salary for an Angular developer is $115k USD.  That is not an exaggeration, it is not a joke - this is how badly employers are looking for Angular developers.  You can be the latest hire at a new tech startup, a fantastic engineer with amazing skills in Angular!  All you have to do to earn this salary is understand Angular, and this course will help you do that."
    },
    {
        "_id": "e342b6c0c8efc8ca9e811991dc8a7901",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": false
        },
        "category_id": "04",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 733,
        "title": "Complete Angular Developer in 2022: Zero to Mastery",
        "author": {
            "name": "Theo Minh Châu",
            "published_date": "2022-08-25 06:03:00",
            "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
        },
        "thumbnail_url": "https://images.unsplash.com/photo-1592609931095-54a2168ae893?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80",
        "image_url": "https://images.unsplash.com/photo-1592609931095-54a2168ae893?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80",
        "details": "Just released with all new Angular best practices and trends for 2022! Join a live online community of over 600,000+ developers and a course taught by industry experts that have actually worked both in Silicon Valley and Toronto with Angular.Using the latest version of Angular, this course is focused on efficiency and turning you into a professional Angular developer. Never spend time on confusing, out of date, incomplete tutorials anymore! Graduates of Andrei’s courses are now working at Google, Tesla, Amazon, Apple, IBM, JP Morgan, Facebook (Meta), + other top tech companies for a reason.We guarantee you this is the most comprehensive online resource on Angular. This project based course will introduce you to all of the modern toolchain of an Angular (formally AngularJS/Angular.js) developer in 2022. Along the way, we will build a massive video sharing application using Angular, TypeScript, WebAssembly, Rust, RxJS, TailwindCSS, Firebase and much more! This is going to be a Fullstack app. We will also build other mini projects along the way so you feel confident deploying any Angular project to production in the future by yourself!"
    },
    {
        "_id": "cd2b53655737cc4077542baea9f8f75d",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": true
        },
        "category_id": "02",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 700,
        "title": "Javascript for Beginners Learn by Doing Practical Exercises",
        "author": {
            "name": "Daniel Deangelo",
            "published_date": "2022-08-30 20:02:52",
            "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
        },
        "thumbnail_url": "https://images.unsplash.com/photo-1505238680356-667803448bb6?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80",
        "image_url": "https://images.unsplash.com/photo-1505238680356-667803448bb6?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80",
        "details": "Looking for a quick and easy way to learn Javascript?This course if for absolute beginners, and it is an introduction to the major components of javascript. By learning the bigger things in Javascript, you will be able to know how to put the remaining pieces together and will be able to get into advanced courses more prepared. I'm not going to start this course with False promises. At the end of this course, you will NOT become an expert and nor will you in any other course. To become an expert in Javascript or any other programming language you need many hours of practice and experience; more like years of practice and experience.My PROMISE to you. My promise to you is that all the lessons you will see here, will get engraved in your brain better than in any other course, why? My approach is the practice approach which is the number one key to learning any programming language or technical course faster and easier."
    },
    {
        "_id": "7c4dfea0fafddc813673282a428429b7",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": true
        },
        "category_id": "01",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 0,
        "title": "React Tutorial and Projects Course (2022)",
        "author": {
            "name": "Reuters",
            "published_date": "2022-08-25 03:09:16",
            "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
        },
        "thumbnail_url": "https://images.unsplash.com/photo-1591267990532-e5bdb1b0ceb8?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=827&q=80",
        "image_url": "https://images.unsplash.com/photo-1591267990532-e5bdb1b0ceb8?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=827&q=80",
        "details": "React was released by Facebook's web development team in 2013 as a view library. React is one of the best choices for building modern web applications. React has a slim API, a robust and evolving ecosystem and a great community. In this course we will be learning React by creating various projects.If you want to learn more than just same old tutorial and instead create interesting projects using React.js this course is for you. During the course we will also cover redux-toolkit, which is the latest flavor of good old redux and build an interesting project with it. After each tutorial section we will build few projects to put see theory in action. You are not expected to build all projects, but the more course projects, you will complete the easier it's going to be to build your own applications, since you will know how to implement certain features in react."
    },
    {
        "_id": "30af81e91ab3eafc0bcae0de62f55d5c",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": true
        },
        "category_id": "01",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 320,
        "title": "Full React Js Course: React JS, Redux, Hooks and Context",
        "author": {
            "name": "John Pike",
            "published_date": "2022-08-25 07:35:11",
            "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
        },
        "thumbnail_url": "https://images.unsplash.com/photo-1627398242454-45a1465c2479?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=774&q=80",
        "image_url": "https://images.unsplash.com/photo-1627398242454-45a1465c2479?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=774&q=80",
        "details": "People's Daily Online (Xinhua) 08:16, August 25, 2022 The United States has committed more than 13.5 billion dollars in security assistance to Ukraine since President Joe Biden took office. WASHINGTON, Aug. 24 (Xinhua) -- The United States on Wednesday announced an additional tranche of security assistance to Ukraine worth nearly 3 billion U.S. dollars, the largest one-time weapons aid to Kiev that came as the Russia-Ukraine conflict reached the half-year mark. According to a breakdown by the Department of Defense (DoD), items in the newly-announced package include six additional National Advanced Surface-to-Air Missile Systems (NASAMS) with additional munitions for NASAMS, up to 245,000 rounds of 155mm artillery ammunition, up to 65,000 rounds of 120mm mortar ammunition, up to 24 counter-artillery radars, Puma Unmanned Aerial Systems (UAS) and support equipment for Scan Eagle UAS systems,   Vampire   counter-UAS systems, as well as laser-guided rocket systems."
    },
    {
        "_id": "df11ff9feefc37613cc3a4486ce02151",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": false
        },
        "category_id": "02",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 552,
        "title": "JavaScript from Beginner to Expert",
        "author": {
            "name": "system",
            "published_date": "2022-08-27 05:38:02",
            "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
        },
        "thumbnail_url": "https://images.unsplash.com/photo-1472437774355-71ab6752b434?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=774&q=80",
        "image_url": "https://images.unsplash.com/photo-1472437774355-71ab6752b434?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=774&q=80",
        "details": "Would you like to learn JavaScript and become a good earning front-end developer? Save your precious time by buying this course. You will learn how to program in JavaScript in a fast and easy way!The total length of the JavaScript course is over 12 hours! You will learn theory and you will also gain lots of practice. During the course, I will explain to you how to write real-life applications, like galleries with thumbnails, image sliders, etc.I will do everything so that you understand JavaScript. After this course, you will always understand the code you are writing. You will understand all concepts and create your own applications! After my course, you can become a front-end developer. JavaScript is a very demanded language by employers.The course is designed for people who don't have any knowledge about programming or want to truly understand JavaScript. It doesn't matter if you have never written any programs or you have no idea about programming... After my course, all this will change. You will bust the myth that programming is a difficult thing only for the few!"
    },
    {
        "_id": "acb9b6785b62698fc6130db7615965e1",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": true
        },
        "category_id": "03",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 879,
        "title": "Step-by-step HTML and CSS for Absolute Beginners",
        "author": {
            "name": "RTTNews",
            "published_date": "2022-08-25 11:53:13",
            "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
        },
        "thumbnail_url": "https://images.unsplash.com/photo-1563206767-5b18f218e8de?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=869&q=80",
        "image_url": "https://images.unsplash.com/photo-1563206767-5b18f218e8de?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=869&q=80",
        "details": "Want to learn how to create webpages, but feeling intimidated by HTML and CSS? Not sure where to start? Step-by-step HTML and CSS for Absolute Beginners is a comprehensive and friendly course designed for beginners with NO previous coding or programming experience.HTML (HyperText Markup Language) and CSS (Cascading Style Sheets) are the building blocks of the web. If you've ever looked at a website, you've seen HTML and CSS in action! Whether you want to make changes to your website's template, create new webpages from scratch, or just understand what you're doing when you cut-and-paste embed codes from sites like YouTube or SlideShare — understanding HTML and CSS makes it possible."
    },
    {
        "_id": "be44c843d61859cc0b87cae85c55f9db",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": true
        },
        "category_id": "01",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 231,
        "title": "React js. From the beginning. w/ Redux and React Router",
        "author": {
            "name": "Kumar Natasha",
            "published_date": "2022-08-26 12:15:36",
            "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
        },
        "thumbnail_url": "https://images.unsplash.com/photo-1485856407642-7f9ba0268b51?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80",
        "image_url": "https://images.unsplash.com/photo-1485856407642-7f9ba0268b51?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80",
        "details": "Starting with Angular 1 in 2010, JavaScript frameworks exploded onto the scene and are required by virtually every large website on the Internet. React, which appeared a few years later in 2013  has become the dominant tool in that group. What does that mean for you? You can learn to use the same front-end framework used by Facebook, Amazon, Netflix, BBC, Airbnb, and Ebay, to name a few. And you won't just learn how to use it, but you'll learn the fundamentals around it. What I need from you: I need you to know JavaScript, CSS, and HTML. It's not required to use React, but React makes very heavy use of ES6 (the 2015 update to JavaScript), so the course will use ES6 after the first main section. I will briefly mention how it works as needed, and add a supplemental section that covers those parts.I need you know how to navigate your computer, not be afraid of the terminal, and ask questions as you have them!"
    },
    {
        "_id": "1b03149c50f1bec662062d930bf46489",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": true
        },
        "category_id": "02",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 546,
        "title": "JavaScript: Understanding the Weird Parts",
        "author": {
            "name": "The Philadelphia Inquirer",
            "published_date": "2022-08-30 22:00:00",
            "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
        },
        "thumbnail_url": "https://images.unsplash.com/photo-1587620962725-abab7fe55159?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1031&q=80",
        "image_url": "https://images.unsplash.com/photo-1587620962725-abab7fe55159?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1031&q=80",
        "details": "Javascript is the language that modern developers need to know, and know well. Truly knowing Javascript will get you a job, and enable you to build quality web and server applications. NOTE: This course includes information on ECMAScript 6 (ES6) the next version of Javascript! In this course you will gain a deep understanding of Javascript, learn how Javascript works under the hood, and how that knowledge helps you avoid common pitfalls and drastically improve your ability to debug problems. You will find clarity in the parts that others, even experienced coders, may find weird, odd, and at times incomprehensible. You'll learn the beauty and deceptive power of this language that is at the forefront of modern software development today.This course will cover such advanced concepts as objects and object literals, function expressions, prototypical inheritance, functional programming, scope chains, function constructors (plus new ES6 features), immediately invoked function expressions (IIFEs), call, apply, bind, and more. We'll take a deep dive into the source code of popular frameworks such as jQuery and Underscore to see how you can use your understanding of Javascript to learn (and borrow) from other's good code. Finally, you'll learn the foundations of how to build your own Javascript framework or library. What you'll learn in this course will make you a better Javascript developer, and improve your abilities in AngularJS, NodeJS, jQuery, React, Ember, MongoDB, and all other Javascript-based technologies! Learn to love Javascript, and code in it well.Note: In this course you'll also get downloadable source code. You will often be provided with 'starter' code, giving you the base for you to start writing your code, and 'finished' code to compare your code to."
    },
    {
        "_id": "7f5b80c1cdd4df0111918883eae07349",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": true
        },
        "category_id": "03",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 1870,
        "title": "Build Websites from Scratch with HTML & CSS",
        "author": {
            "name": "system",
            "published_date": "2022-08-24 23:15:00",
            "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
        },
        "thumbnail_url": "https://images.unsplash.com/photo-1610018556010-6a11691bc905?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80",
        "image_url": "https://images.unsplash.com/photo-1610018556010-6a11691bc905?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80",
        "published_date": "2022-08-24 18:00:00",
        "details": "With this online course—from one of Udemy's top web design instructors, Brad Hussey—you will learn HTML & CSS by building beautiful, modern and responsive websites! You will have a strong foundation in web development that will enable you to start creating any website you can imagine. By the end of this course, you will be competent in HTML & CSS and be able to create your own professional-grade website from scratch – no prior experience required! You will also have the skillset necessary to continue learning about web development and advancing your career.Sign up for this online course today and start building your very own websites!"
    },
    {
        "_id": "61f9ce168f7b15aadecb1d1fc80c72f7",
        "others_info": {
            "is_todays_pick": false,
            "is_trending": false
        },
        "category_id": "04",
        "rating": {
            "number": 4.5,
            "badge": "Excellent"
        },
        "total_view": 100,
        "title": "Angular - The Complete Guide (2022 Edition)",
        "author": {
            "name": "system",
            "published_date": "2022-08-26 00:37:24",
            "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
        },
        "thumbnail_url": "https://images.unsplash.com/photo-1566837945700-30057527ade0?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80",
        "image_url": "https://images.unsplash.com/photo-1566837945700-30057527ade0?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80",
        "details": "Join the most comprehensive and bestselling Angular course on Udemy and learn all about this amazing framework from the ground up, in great depth! This course starts from scratch, you neither need to know Angular 1 nor Angular 2! Angular 13 simply is the latest version of Angular 2, you will learn this amazing framework from the ground up in this course! Join the most comprehensive, popular and bestselling Angular course on Udemy and benefit not just from a proven course concept but from a huge community as well! From Setup to Deployment, this course covers it all! You'll learn all about Components, Directives, Services, Forms, Http Access, Authentication, Optimizing an Angular App with Modules and Offline Compilation and much more - and in the end: You'll learn how to deploy an application! But that's not all! This course will also show you how to use the Angular CLI and feature a complete project, which allows you to practice the things learned throughout the course!And if you do get stuck, you benefit from an extremely fast and friendly support - both via direct messaging or discussion. You have my word! ;-)"
    }
]